tests/writers/testOpenFoamWriter/single_segment/gold/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
	(-0.025 0.000 0) 	//0
	( 0.025 0.000 0) 	//1
	( 0.025 0.100 0) 	//2
	(-0.025 0.100 0) 	//3
	(-0.025 0.000 0.01) //4
	( 0.025 0.000 0.01) //5
	( 0.025 0.100 0.01) //6
	(-0.025 0.100 0.01) //7 - inlet hex end
	( 0.025 1.000 0)	//8
	(-0.025 1.000 0)	//9
	( 0.025 1.000 0.01) //10
	(-0.025 1.000 0.01) //11
);
blocks
(
	hex (0 1 2 3 4 5 6  7 ) (5 10 1) simpleGrading (1 1 1)
	hex (3 2 8 9 7 6 10 11) (5 90 1) simpleGrading (1 1 1)
);
edges
(
);
patches
(
	patch inlet
	(
	(1 5 4 0)
	)
	patch outlet
	(
	(9 11 10 8)
	)
	wall walls
	(
	(0 4 7  3)
	(2 6 5  1)
	(3 7 11 9)
	(2 6 10 8)
	)
);

mergePatchPairs
(
);

// ************************************************************************* //
