tests/writers/testOpenFoamWriter/single_segment/gold/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       895;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       900;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       905;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       1105;
    }
)

// ************************************************************************* //
